src/DataProcessors/АктивныеСоединения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>АктивныеСоединения</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыполнятьВФоне</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючФоновогоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндикаторПроцесса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВременногоХранилищаДляВнутреннегоОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаОбработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяБаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АктивныеСоединения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяБаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПриложения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКомпьютера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоСоединения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСеанса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСоединения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/АктивныеСоединения/Ext/ObjectModule.bsl
Перем мИмяСобытияВЖурналеРегистрации Экспорт;

//
//
Процедура ЗаполнитьТаблицуАктивныхСоединений()  Экспорт
	
	ЭтотОбъект.АктивныеСоединения.Очистить();
	
	Для Каждого ТекущаяСтрокаТаблицаОбработки Из ЭтотОбъект.ТаблицаОбработки Цикл
				
		ЭтотОбъект.АктивныеСоединения.Загрузить(ОбщегоНазначенияСервер.ОбъединитьИдентичныеТаблицы(ЭтотОбъект.АктивныеСоединения.Выгрузить(), ПолучитьТаблицуАктивныхСоединений(ТекущаяСтрокаТаблицаОбработки.ИнформационнаяБаза)));
		
	КонецЦикла;
	
КонецПроцедуры  

//
//
Функция ПолучитьТаблицуАктивныхСоединений(ИнформационнаяБаза, ИсключатьТекущееСистемноеCOMСоединение = Истина)  Экспорт
	
	лТаблицаАктивныхСоединений = ЭтотОбъект.АктивныеСоединения.Выгрузить();
	лТаблицаАктивныхСоединений.Очистить();
	
	МассивАктивныхСоединений = ЗадачиНаСервере.ПолучитьМассивАктивныхСоединений(ЗадачиНаСервере.ПолучитьСтруктуруПараметровОбработки(ИнформационнаяБаза));

	Если МассивАктивныхСоединений <> Неопределено Тогда
		
		ИнформационнаяБазаПользователь = ИнформационнаяБаза.Пользователь;
		
		Для Каждого ТекущееЗначениеМассивАктивныхСоединений Из МассивАктивныхСоединений Цикл
			
			ТекущееЗначениеМассивАктивныхСоединенийПользовательИмя = ТекущееЗначениеМассивАктивныхСоединений.Пользователь.Имя;
			ТекущееЗначениеМассивАктивныхСоединенийИмяПриложения = ТекущееЗначениеМассивАктивныхСоединений.ИмяПриложения;
			
			Если ИсключатьТекущееСистемноеCOMСоединение И НРег(ТекущееЗначениеМассивАктивныхСоединений.ИмяПриложения) = "comconnection" И 
				ТекущееЗначениеМассивАктивныхСоединенийПользовательИмя = СокрЛП(ИнформационнаяБазаПользователь) Тогда 
				Продолжить;
			КонецЕсли;
			
			НоваяСтрокаТаблицаАктивныхСоединений = лТаблицаАктивныхСоединений.Добавить();
			//ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицаАктивныхСоединений, ТекущееЗначениеМассивАктивныхСоединений);
			НоваяСтрокаТаблицаАктивныхСоединений.ИнформационнаяБаза = ИнформационнаяБаза;
			НоваяСтрокаТаблицаАктивныхСоединений.Пользователь = ТекущееЗначениеМассивАктивныхСоединенийПользовательИмя;
			НоваяСтрокаТаблицаАктивныхСоединений.ИмяПриложения = ПолучитьПредставлеинеИмениПриложения(ТекущееЗначениеМассивАктивныхСоединенийИмяПриложения);
			НоваяСтрокаТаблицаАктивныхСоединений.ИмяКомпьютера = ТекущееЗначениеМассивАктивныхСоединений.ИмяКомпьютера;
			НоваяСтрокаТаблицаАктивныхСоединений.НачалоСоединения = ТекущееЗначениеМассивАктивныхСоединений.НачалоСоединения;
			НоваяСтрокаТаблицаАктивныхСоединений.НомерСеанса = ТекущееЗначениеМассивАктивныхСоединений.НомерСеанса;
			НоваяСтрокаТаблицаАктивныхСоединений.НомерСоединения = ТекущееЗначениеМассивАктивныхСоединений.НомерСоединения;
			
		КонецЦикла;
	КонецЕсли;
	
	лТаблицаАктивныхСоединений.Сортировать("ИнформационнаяБаза, Пользователь");
	
	Возврат лТаблицаАктивныхСоединений;
КонецФункции

//
//
Функция ПолучитьПредставлеинеИмениПриложения(ИмяПриложения) Экспорт 
	Результат = ИмяПриложения;
	
	Если ИмяПриложения = "1CV8" Тогда
		Результат = "Толстый клиент";
	ИначеЕсли ИмяПриложения = "1CV8C" Тогда
		Результат = "Тонкий клиент";
	ИначеЕсли ИмяПриложения = "WebClient" Тогда
		Результат = "Веб-клиент";
	ИначеЕсли ИмяПриложения = "Designer" Тогда
		Результат = "Конфигуратор";
	ИначеЕсли ИмяПриложения = "WSConnection" Тогда
		Результат = "Web-Сервис";
	ИначеЕсли ИмяПриложения = "SrvrConsole" Тогда
		Результат = "Консоль кластера";
	ИначеЕсли ИмяПриложения = "COMConsole" Тогда
		Результат = "Административная сессия внешнего соединения";
	ИначеЕсли ИмяПриложения = "RAS" Тогда
		Результат = "Сервера администрирования";
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

мИмяСобытияВЖурналеРегистрации = "GetActiveConnections";
